---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerTableIterator.MoveNext
source: html/1c0de63e-cc11-b527-ec85-7971bae1386b.htm
---
# Autodesk.Revit.DB.ExportLayerTableIterator.MoveNext Method

Increments the iterator to the next item.

## Syntax (C#)
```csharp
public virtual bool MoveNext()
```

## Returns
True if there is a next available item in this iterator.
 False if the iterator has completed all available items.